Repository: Bespridelschic/TimeTrace
Catalog: TimeTrace/Strings/*/SignInUp.resw
Source language: en_us
Languages: ru_ru

# AccountActivateText
source: Account activation
ru_ru: Активировать аккаунт

# AccountSuccessRegistredText
source: Account successfully registered
ru_ru: Аккаунт успешно зарегистирован

# AccountVerificationText
source: Account Verification
ru_ru: Подтверждение аккаунта

# ActivationInstructionText
source: Check your E-mail, we are send you instruction for activation
ru_ru: На вашу электронную почту отправлено письмо с инструкцией по активации

# BirthdayCalendar.Header
source: Birthday:
ru_ru: Дата рождения:

# BirthdayCalendar.PlaceholderText
source: Set your date of birth...
ru_ru: Установите дату рождения...

# BirthdayCalendar.ToolTipService.ToolTip
source: Set your real date of birth
ru_ru: Уточните дату вашего рождения

# CantActivateAccountText
source: Remote server isn't available now. Please, Try later
ru_ru: Не предвиденная ошибка. Повторите попытку позже

# CantChangePasswordText
source: Password change error. Please, try later
ru_ru: Ошибка изменения пароля! Сброс пароля не возможен

# ChangePasswordText
source: Changing password
ru_ru: Изменение пароля

# CheckCorrectionText
source: Check your input data or create a new account
ru_ru: Проверьте корректность введенных данных, или зарегистрируйте новый аккаунт

# ConfirmPasswordBoxRegistration.Header
source: Confirm password:
ru_ru: Подтвердите пароль:

# ConfirmPasswordBoxRegistration.PlaceholderText
source: Confirm your password...
ru_ru: Подтвердите ваш пароль...

# ConfirmPasswordBoxRegistration.ToolTipService.ToolTip
source: Confirm the password entered earlier
ru_ru: Подтвердите пароль, введённый ранее

# EmailAlreadyRegisteredText
source: E-mail with this email already registered
ru_ru: Пользователь с таким Email уже зарегистрирован

# EmailBox.Header
source: E-mail address:
ru_ru: Почта:

# EmailBox.PlaceholderText
source: Enter your E-mail...
ru_ru: Введите ваш эл. адрес...

# EmailBox.ToolTipService.ToolTip
source: Enter registered E-mail
ru_ru: Введите зарегистрированный адрес электронной почты

# EmailBoxRegistration.Header
source: E-mail:
ru_ru: Электронная почта:

# EmailBoxRegistration.PlaceholderText
source: Enter your E-mail...
ru_ru: Введите вашу эл. почту...

# EmailBoxRegistration.ToolTipService.ToolTip
source: Enter your registrered E-mail
ru_ru: Введите вашу реальную электронную почту

# EmailBoxRegistrationHeader
source: E-mail:
ru_ru: Электронная почта:

# EmailBoxRegistrationPlaceholderText
source: Enter your E-mail...
ru_ru: Введите вашу эл. почту...

# FillAllFieldsText
source: Fill in all the fields
ru_ru: Необходимо заполнить все поля

# FirstNameTextBox.Header
source: First name:
ru_ru: Имя:

# FirstNameTextBox.PlaceholderText
source: Enter your first name...
ru_ru: Введите ваше имя...

# FirstNameTextBox.ToolTipService.ToolTip
source: Enter your real first name
ru_ru: Введите своё имя

# GetKeyButtonText
source: Get key
ru_ru: Получить код

# HeaderTextBoxExtendPage.Text
source: Common information
ru_ru: Общая информация

# HeaderTextBoxRegistrationPage.Text
source: Registration
ru_ru: Регистрация

# IncorrectEmailText
source: E-mail incorrect. Check it again
ru_ru: Проверьте корректность введенного адреса электронной почты

# LastNameTextBox.Header
source: Last name:
ru_ru: Фамилия:

# LastNameTextBox.PlaceholderText
source: Enter your last name...
ru_ru: Введите вашу фамилию...

# LastNameTextBox.ToolTipService.ToolTip
source: Enter your real last name
ru_ru: Введите свою фамилию

# LaterButtonText
source: Later
ru_ru: Позже

# MiddleNameTextBox.Header
source: Middle name:
ru_ru: Отчество:

# MiddleNameTextBox.PlaceholderText
source: Enter your middle name...
ru_ru: Введите ваше отчество...

# MiddleNameTextBox.ToolTipService.ToolTip
source: Enter your real middle name if you have one
ru_ru: Введите своё отчество

# NewPasswordHeader
source: New password:
ru_ru: Новый пароль:

# NewPasswordPlaceholderText
source: Input a new password...
ru_ru: Введите новый пароль...

# NoMatchesFoundText
source: No matches found for accounts.
ru_ru: Не найдено совпадений с существующими аккаунтами.

# ObligatoryFieldAttentionText.Text
source: All fields are obligatory*
ru_ru: Все поля являются обязательными*

# OperationFailedText
source: Operation failed
ru_ru: Ошибка операции

# OptionalFieldAttentionText.Text
source: All field are optional*
ru_ru: Поля не являются обязательными*

# PasswordBox.Header
source: Password:
ru_ru: Пароль:

# PasswordBox.PlaceholderText
source: Enter your password...
ru_ru: Введите ваш пароль...

# PasswordBox.ToolTipService.ToolTip
source: Enter your real account password
ru_ru: Введите ваш пароль от аккаунта

# PasswordBoxRegistration.Header
source: Password:
ru_ru: Пароль:

# PasswordBoxRegistration.PlaceholderText
source: Enter strong password...
ru_ru: Введите желаемый пароль...

# PasswordBoxRegistration.ToolTipService.ToolTip
source: Enter strong account password
ru_ru: Введите пароль, с помощью которого вы будете входить в систему. Придумайте надёжный пароль

# PasswordForgotLink.Content
source: Forgot password?
ru_ru: Забыли пароль?

# PasswordForgotLink.ToolTipService.ToolTip
source: Go to password recovery page
ru_ru: Перейти на страницу восстановления пароля

# PasswordLengthShortText
source: Password must be at least 8 characters
ru_ru: Минимальная длина пароля должна составлять 8 символов

# PasswordRecoveryText
source: Password recovery
ru_ru: Восстановление пароля

# PasswordSaveChechBox.Content
source: Save the password
ru_ru: Сохранить пароль

# PasswordSaveChechBox.ToolTipService.ToolTip
source: Use automatic login
ru_ru: Использовать автоматический вход в систему

source: Passwords do not match
ru_ru: Введенные пароли не совпадают

# RecoveryButtonText
source: Recovery
ru_ru: Восстановить

# RegistrationButton.Content
source: Create account
ru_ru: Зарегистироваться

# RegistrationButton.ToolTipService.ToolTip
source: Create an account in the system
ru_ru: Зарегистрироваться в системе

source: Registration error
ru_ru: Ошибка регистрации

# RegistrationNextStepButton.Content
source: Next
ru_ru: Далее

# RegistrationNextStepButton.ToolTipService.ToolTip
source: Continue registration in the system
ru_ru: Продолжить регистрацию в системе

# RegistrationProblemText
source: Registration problem
ru_ru: Проблема регистрации

# ServerConnectionProblemBadRegistrationText
source: Registration error, remote server is not available. Please try again later
ru_ru: Ошибка регистрации, удаленный сервер не доступен. Повторите попытку позже

# ServerConnectionProblemText
source: Remote server isn't available now. Please, Try later
ru_ru: Ошибка входа, удаленный сервер не доступен. Повторите попытку позже

# SignInButton.Content
source: Sign in
ru_ru: Вход

# SignInButton.ToolTipService.ToolTip
source: Login to the system
ru_ru: Войти в систему

# SignInErrorText
source: Sign in error
ru_ru: Ошибка входа

# SignUpLink.Content
source: Sign up
ru_ru: Зарегистрировать новый аккаунт

# SignUpLink.ToolTipService.ToolTip
source: Go to sign up page
ru_ru: Перейти на страницу регистрации

# SuccessText
source: Success
ru_ru: Успех

# UndefinedErrorText
source: Undefined error. Please, contact the developer
ru_ru: Не предвиденная ошибка. Обратитесь к разработчику
